Revit 2024 API
FabricAreaType Class
 A FabricAreaType object is used in FabricArea object generation.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class FabricAreaType : ElementType
Visual Basic
Public Class FabricAreaType _
	Inherits ElementType
Visual C++
public ref class FabricAreaType : public ElementType
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.FabricAreaType
See Also
FabricAreaType Members
Autodesk.Revit.DB.Structure Namespace